[{"title":"Our Leadership","body_content":"<img src=\"https://dl.airtable.com/qtUdI5RTM6qH9PDyZgDQ_DSC_7371.JPG\" height=\"300\" width=\"235\"/>\n\n## Our Pastor\n\nDavid Bousquet is a graduate of Pensacola Christian College and a graduate of Liberty Baptist Theological Seminary.   In addition, he is the author of [\"Simply Put: Truths of Heaven Brought Down to Earth\"](https://www.amazon.com/Simply-Put-Truths-Heaven-Brought/dp/B003QL148W), and [\"He is Exalted: An Exposition of Colossians\"](https://www.amazon.com/Exalted-Exposition-Colossians-David-Bousquet/dp/1682701824/ref=sr_1_1?s=books&ie=UTF8&qid=1469411474&sr=1-1&keywords=He+is+Exalted%3A+An+Exposition+of+Colossians). He has served here since 2005.   During that time the church has experienced tremendous growth both spiritually and physically.  \n\nDavid's philosophy of ministry is simple, discipleship.  He preaches messages in an expositional style, while focusing on practical theology.  It is his belief that all theology must be able to be applied to the believer's daily life, and as such he stresses the need for daily study and practical holiness.  \n\nDavid is joined in the ministry by his wife Sandy and their children. \n\nWhen not ministering, David enjoys spending time with his family, reading, fencing, roasting coffee, and writing books.\n\nYou can follow David on twitter at twitter.com/DavidJBousquet .\n---\n\n\n","featured_image":[{"id":"att0KZmrsS1hGnKtp","url":"https://dl.airtable.com/SZGGxhlnRE2XYsrMpR6m_leadership_header.jpg","filename":"leadership_header.jpg","size":400123,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/Uxn1ua3fRHusy72ZJirp_small_leadership_header.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/Ks8HJn1RWykHurqbjNIe_large_leadership_header.jpg","width":512,"height":512}}}],"type":"Leadership ","updated_at":"2016-07-11","published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"What We Believe","body_content":"1. We believe in the Scriptures of the Old and New Testaments as verbally and plenarily inspired by God and without error in the original writings and supernaturally preserved by God in the subsequent copies of the writings which were accepted and canonized by the early church; that the Bible is reliable and accurate in science, history, and every other matter it discusses; and that the Bible is of supreme and final authority in all of faith and life. 2 Timothy 3:16; 2 Peter 1:19-21.\n\n2. We believe in one Triune God, eternally existing in three Persons—Father, Son, and Holy Spirit—co-eternal in being, co-identical in nature, co-equal in power and glory, and having the same attributes and perfections. Exodus 20:2,3; 1 Corinthians 8:6; 1 John 5:7; Matthew 28:19, 20; 2 Corinthians 13:14.\n\n3. We believe in God the Father, perfect in holiness, infinite in wisdom, measureless in power; that He concerns Himself mercifully I the affairs of men, that He hears and answers prayer, and that He saves from eternal death and from hell all who come to Him through Jesus Christ. Psalm 22:3; John 17:11; Psalm 147:5; 1 John 3:20; Matthew 19:26; John 3:16; Matthew 6:26-30; Psalm 65:2; Hebrews 11:6; Romans 5:8; 1 Timothy 2:5; John 14:6.\n\n4. We believe in the absolute Deity of the Lord Jesus Christ; His eternal existence as God, equal with the Father and the Holy Spirit; His incarnation by means of the virgin birth; His sinless ness; His vicarious death through the shedding of His blood as the atonement for the remission of our sin; His literal and bodily resurrection from the dead; His ascension into heaven; His present high priestly ministry in heaven for believers; and His personal bodily return to earth. 1 John 5:20; John 1:16; John 14:9; Hebrews 1:8; Isaiah 7:14; Matthew 1:18-25; Luke 1:26-35; 1 Peter 2:22; Romans 3:25; Hebrews 9:14; Luke 24:36-43; Acts 10:40,41; Acts 1:9; Luke 24:51; Hebrews 8:1,2; I John 2:1; Acts 1:11; 1 Thessalonians 4:16.\n\n5. We believe that the Holy Spirit is a Divine Person, equal with the Father and the Son and of the same substance and nature; that He convicts the world of sin, righteousness, and judgment; that He bears witness to the Truth; that He is the Agent of the new birth; that he baptizes all true believers into the body of Christ, indwelling and sanctifying all of them, sealing and thus securing them unto the day of redemption, that He endues, guides, teaches and helps believers; and that it is the privilege and duty of all the saved to be filled with the Spirit. Matthew 28:19; 1 Corinthians 12:12, 13; Romans 8:9; John 16:8-11; Ephesians 1:13,14; 4:30; 5:18.\n\n6. We believe that God is sovereign in the bestowment of His gifts; that each believer has at least one gift; and that some of the gifts such as speaking in tongues and miraculous healings were designed to authenticate and validate the giving of new revelation during the New Testament era; and that the speaking in tongues was never the common or necessary sign of the baptism or of the filling of the Holy Spirit. 1 Corinthians 12:11; 1 Peter 4:10; 1 Corinthians 13:8-10; Ephesians 4:17-12; I Corinthians 12:28-31; Hebrews 2:3,4; 2 Peter 1:3; Ephesians 2:20.\n\n7. We believe that God created the heavens and earth, including all life, each after its own species, by direct act and not by the process of any type of evolution. This creation also serves as the model for all marriage; in that God created marriage by establishing that marriage is between one man and one woman as demonstrated in the divine creation of Adam and Eve as the first representatives of humanity and marriage. As such we believe in the preservation of the traditional definition of marriage, and believe that all violation of that union to be sinful in the eyes of God. Genesis 1 and 3; Colossians 1:16, 17; John 1:3; Leviticus 18; Romans 1.\n\n8. We believe that man, in the person of the first Adam, was created in the image of God, in innocence under the law of His Maker, but by reason of his voluntary sin, fell from his high and holy state; that as a result the whole human race plunged into condemnation and death, so that now all human beings are conceived with a sinful nature; and so as sinners are without excuse before God. Genesis 1:26,27; Genesis 3; Romans 5:10-19; Psalm 51:5; Romans 1:18-32; Romans 3:10-23.\n\n9. We believe that the justification of sinners is wholly of grace through faith in the death, burial and resurrection of the Lord Jesus Christ whose precious blood was shed on Calvary’s cross; that all who receive Him are regenerated by the Holy Spirit and become children of God; that no rite, ceremony or good work can avail in any way for the sinner’s salvation or make the believer’s salvation more secure; that Jesus Christ is the only and all sufficient Savior; and that all who are truly saved are kept forever. Ephesians 2:8,9; Titus 3:5-7; John 5:24; John 1:12; Romans 10:9-13; Acts 16:31; Acts 4:12; 2 Timothy 1:12; John 10:28,29; Romans 8:35-39; Philippians 1:6.\n\n10. We believe that the offer of salvation through the gospel should be preached to all mankind and that it is the immediate duty of all who hear to repent of their sin of unbelief and accept Jesus Christ as their Lord and Savior; that the scriptures plainly teach that God, out of His good pleasure and according to His divine foreknowledge, from all eternity, has elected some to everlasting life and has chosen to deliver them from a state of sin and misery to bring them to Himself. Deuteronomy 10:14,15; Matthew 22:14; Romans 8:28-30; 1 Corinthians 1:27-29; Ephesians 1:4; Revelation 13:8.\n\n11. We believe that every saved person possesses two natures; that he has the old nature for the duration of his earthly life; but that provision is made for victory of the new nature over the old nature through the power of the indwelling Holy Spirit. Romans 7:15-25; Romans 6:11-14; Philippians 4:7-14; Philippians 3:7-14; 2 Corinthians 12:7-10.\n\n12. We believe that sanctification for the believer is immediate, upon acceptance of Jesus Christ as Savior, and that sanctification progresses, continuing to the end of earthly life; and that the progressive phase of sanctification is carried on in the hearts of believers by the presence and power of the Holy Spirit in the continual use of the appointed means, especially the study of God’s Word, self-denial, faithfulness in and through a local fundamental church, prayer, and seeking to win the lost. 1 Corinthians 1:2; 1 Corinthians 6:11; Hebrews 10:10, 14; 1 Thessalonians 3:12, 13; 1 Thessalonians 4:1-12; 2 Peter 3:18; Ephesians 4:11-16; Hebrews 10:25.\n\n13. We believe that the saved are called into a life of separation from religious apostasy, and from all worldly and sinful pleasures, practices, and associations. Romans 12:1, 2; 1 Thessalonians 5:22; 1 John 2:15-17; 2 Corinthians 6:14-18; Romans 6:16, 17; 2 John 7-11; Ephesians 5:11.\n\n14. We believe that the Lord’s Supper is a commemoration of the Lord’s death until He comes again; and that, in this ordinance, the Lord’s Table should be open to all regenerated persons living in fellowship with, and obedience to Jesus Christ. 1 Corinthians 11:23-32; Luke 22:14-20.\n\n15. We believe that Biblical baptism involves the immersion of a believer in water, thus setting forth in symbol his union with Jesus Christ in His death, burial, and resurrection; that every believer should be baptized because of the example and command of the Lord; and that while there is no saving power in water baptism, it is an act of obedience by those who are already saved to picture that they are dead, buried, and raised spiritually with Jesus Christ. We reject infant baptism as unscriptural. Romans 6:3-5; Matthew 3:13-17; Matthew 28:19, 20; Acts 8:36-39; Ephesians 2:8, 9; Titus 3:5; John 5:24.\n\n16. We believe that the local New Testament church is composed of regenerated baptized believers, voluntarily united together for the purpose of worship, edification, observing the ordinances, fellowship, and service; that the officers of the local church are pastors and deacons, whose qualifications, claims, and duties are clearly set forth in the Scriptures; that the true mission of the church is the faithful witnessing of Jesus Christ to all men as we have opportunity in the local community and unto the uttermost parts of the earth; that the local church has absolute right of self-government, free from interference of any hierarchy of individuals or organizations, religious or political; that the one and only head is Jesus Christ, through the Holy Spirit; and that it is scriptural for true churches to cooperate with each other in contending for the faith and for the furtherance of the Gospel, with each local church as the sole judge of the measure and method of its cooperation; and that on all matters of membership, policy of government, discipline and benevolence, the will of the local church is final. Acts 2:41-47; Romans 1:7; Colossians 1:2; 1 Corinthians 1:2; Acts 4:4; Hebrews 10:25; Acts 20:7; Acts 11:26; Philippians 1:1; 1 Timothy 3:1-16; Titus 1:5-8; Hebrews 13:7, 17; 1 Peter 5:1-5; Acts 6:1-8; Matthew 28:18-20; Acts 1:8; Ephesians 1:22, 23; Colossians 1:18; Ephesians 5:23-26; Acts 15:1-27; Acts 11:29, 30; Acts 13:1-4; Philippians 4:14-16; Acts 20:28, 31; 1 Corinthians 5:1-6, 11.\n\n17. We believe in the literal, bodily, personal, pre-millennial and imminent coming of our Lord in the air to catch away all believers unto Himself before the great tribulation period; also, we believe in the personal, visible and glorious return of Jesus Christ to the earth, with believers, at the close of the great tribulation period to judge the living nations and to set up His millennial kingdom on earth. Acts 1:11; John 14:3; 1 Thessalonians 4:13-18; Revelation 4:1; Matthew 24:42-44; 2 Thessalonians 2:7, 8; Matthew 24:29-31; Revelation 19:11-21; Matthew 25:31-46; Revelation 20:1-6; Hebrews 12:22-24.\n\n18. We believe in the bodily resurrection of the dead, the saved to everlasting blessedness at the coming of Christ, and, one thousand years later, the lost to the judgment at the Great White Throne and then to everlasting conscious punishment in the Lake of Fire. John 5:21-30; 1 Thessalonians 4:13-18; 1 Corinthians 15:42-52; Philippians 3:20, 21; Revelation 20:5, 6, 11-15.\n\n19. We believe that the souls of the redeemed are, at death, absent from the body and present with the Lord, where in conscious bliss they await the first resurrection; and that the souls of the lost remain, after death, in the conscious misery until the second resurrection. 2 Corinthians 5:6-8; Philippians 1:23, 24; Luke 16:19-31.\n\n20. We believe that civil government is of divine appointment, for the interests and good order of human society; and that magistrates are to be prayed for, conscientiously honored, and obeyed, except only in things opposed to the will of God as revealed in the Word of God. Romans 13:1-7; Genesis 9:5, 6; Exodus 18:21; 1 Timothy 2:2,3; Acts 4:19, 20; Acts 5:27-29.\n\n21. We believe that in this age of grace, the Lord’s Day, which is Sunday, the day of the Lord’s resurrection, is the proper day for the formal assembly of believers for Christian worship and service; and that it ought to be kept sacred for spiritual purposes, by the abstinence from all unnecessary secular labor and other activities unbecoming to such a day. Acts 20:7; 1 Corinthians 16:1, 2; Colossians 2:13-17; Hebrews 10:25: John 20:1, 19, 26.\n\n22. We believe that God’s covenant people, Israel, shall be redeemed and regathered to the Promised Land from their world-wide dispersion and under the personal and millennial reign of Jesus Christ upon David’s throne in Jerusalem shall become head of the nations. Genesis 12:2.3; Genesis 13:14, 15; Jeremiah 7:7; Deuteronomy 28:63-66; Deuteronomy 30:1-6; Ezekiel 36:22-28; Ezekiel 37:11-28; Romans 11:25-27; Luke 1:30-33; Jeremiah 23:3-6; Jeremiah 33:14-17; Acts 3:19-21; Revelation 20:4-6.\n\n23. We believe that Satan, a fallen angel, is a distinct and real personality, the god of this age, the adversary of Jesus Christ and all believers, and that his destiny, along with all fallen angels (demons) is eternal punishment in the Lake of Fire. Ezekiel 28:1-19; Job 1:6-9; 1 Peter 5:8; Matthew 4:1-11; 1 Timothy 3:7; James 4:7; 2 Corinthians 4:4; Revelation 20:10.","published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0}]
