[{"title":"Our Beliefs","body_content":"Our Beliefs\r\n\r\nWe Believe:\r\n\r\nThe Holy Scriptures\r\nWE BELIEVE the Bible, the Scriptures of the Old Testament and the New Testament, preserved for us in the Masoretic text (Old Testament) Textus Receptus (New Testament) and in the King James Bible, is verbally and plenarily inspired of God. It is the inspired, inerrant, infallible, and altogether authentic, accurate and authoritative Word of God, therefore the supreme and final authority in all things (II Tim. 3:16-17; II Peter 1:21; Rev. 22:18-19).\r\n\r\nThe Trinity\r\nWE BELIEVE in one God (monotheism), eternally existing in three Persons: the Father, the Son (Jesus Christ), and the Holy Spirit—the Trinity. They are co-eternal in being, co-identical in nature, co-equal in power and glory, and have the same attributes and perfections (I John 5:7; Matt. 28:19; Deut. 6:4; II Cor. 13:14; John 14:10, 26).\r\n\r\nJesus Christ\r\nWE BELIEVE in the deity of Jesus Christ, that He was supernaturally begotten by the Holy Spirit, born of a virgin, and is truly, totally God and truly, totally man (Matt. 1:20-21; Luke 1:35-36; 2:10-11). He is the only begotten Son of God (John 1:14; 3:16, 18; I John 4:9) and at the same time God the Son; therefore, the Lord Jesus Christ, sinless, omnipotent, omniscient, Saviour of sinners, King of kings, and Lord of lords.\r\n\r\nWE BELIEVE\r\nin the literal, physical, bodily resurrection of the crucified body of our Lord, in His literal, physical, bodily ascension into Heaven and in His present work there as High Priest, Mediator, and Advocate for us (Heb. 9:24; 10:20-21; I Tim. 2:5-6; I John 2:1, 2).\r\nMan\r\n\r\nWE BELIEVE man was created in the image of God, that he sinned and thereby incurred not only physical death but also that spiritual death which is the eternal separation from God and an everlasting abode in Hell, that all human beings are henceforth born with a sinful nature and, in the case of those who reach the age of moral responsibility, become sinners by choice and practice, in thought, word, and deed, and that sin creates a debt which no man can pay for himself (Rom. 3:23; 5:12; Gen. 1:26-27; I Cor. 11:7).\r\n\r\nThe Gospel\r\nWE BELIEVE the Gospel is the good news that the Lord Jesus Christ died on the cross for our sins; that He was buried that He arose alive and triumphant from the grave and in so doing He made the necessary sacrifice for atonement, became the Substitute for our redemption, which thereby paid our sin debt and purchased our salvation for us; and that all who place their faith in full trust in Him are saved by His shed blood (I Cor. 15:3-4; Col. 1:14; Eph. 1:7; Rom. 5:9; Acts 4:12).\r\n\r\nBeliever’s Baptism\r\nWE BELIEVE each person claiming Christ as Saviour should promptly make public his/her profession of Christ, that each new Christian should follow the Lord’s command for believer’s baptism, that such scriptural baptism is always by immersion (after salvation), that baptism does not save but that it is the Lord’s prescribed way for us to identify ourselves with Him in open confession, that baptism is a symbolic representation, a picture of the death, burial and resurrection of Christ (Matt. 10:32-33; 28:18-20; Luke 9:23; Acts 16:30-34; Rom. 10:9-10).\r\n\r\nThe Holy Spirit\r\nWE BELIEVE that at the precise time of the new birth the believer immediately receives the Holy Spirit and is by Him baptized (placed) into the body of Christ, is forever indwelt by the Holy Spirit as Comforter, Teacher and Guide, and if yielded to Him, is filled by the Spirit and is empowered for service (John 1:32-34; Acts 1:8; Acts 15:8; Rom. 6:13; 12:1-2; Eph. 5:18).\r\n\r\nEternal Security\r\nWE BELIEVE each believer, at the time he puts his trust in Christ, is born into the family of God and does instantaneously become a son or daughter of the living God, thus is redeemed by the Lord’s purchase price paid for us, is henceforth preserved in Christ and, therefore, is forever secure in Christ, possesses everlasting, eternal life and is sealed by the Holy Spirit for eternity (John 10:28-29; Romans 8:38-39; John 5:24; Ephesians 1:13).\r\n\r\nThe Church\r\nWE BELIEVE the Scriptures teach that a local church is a congregation of immersed believers, associated by a covenant of faith and fellowship of the Gospel, observing the ordinances of Christ, governed by His Laws, and exercising the gifts, rights and privileges invested in them by His Word; that its only scriptural officers are bishops or pastors (pastor, bishop and elder are three terms for the same office) and deacons, whose qualifications, claims and duties are clearly defined in the New Testament. I Tim. 3, Titus 1).\r\n\r\nWE BELIEVE\r\nthe true mission of the church is the faithful witnessing of Christ to all men as we have the opportunity, and the building up and edifying of the saints. We hold that the local church has the absolute right of self-government free from the interference of any hierarchy of individuals or organizations and that the one and only Head is Christ through the Holy Spirit (Acts 2:41, 42; 8:1; I Cor. 4:17; Acts 2:47; I Cor. 11:2; Matt. 28:20; John 14:15; 15:10; Acts 14:23; 15:22; II Thess. 3:7; Rom. 16:17-20; I Cor. 11:23; Matt. 18:15-20; I Tim. 3; Titus 1).\r\n\r\nWorld Evangelism\r\nWE BELIEVE the Lord’s Great Commission (Matt. 28:19-20) is His command to us to get the Gospel to the world; therefore, we carry forth an extensive program of soul-winning evangelism in the homeland and a worldwide missionary program abroad, with the goal of winning people to Christ, baptizing them, and teaching them everything the Lord has commanded us (Matt. 28:18-20; Acts 1:8).\r\n\r\nHeaven and Hell\r\nWE BELIEVE Heaven is a real place that is the eternal home of all who by faith claim the salvation of Christ.\r\n\r\nWE BELIEVE\r\nHell is a real place that is the eternal home of all who die without Christ as their Saviour.\r\n\r\nWE BELIEVE\r\nin the literal, physical, bodily resurrection of both the saved and the lost (I Thess. 4:13-18; Rev. 20:5-6), the everlasting blessedness of the saved (Heaven) (John 14:1-3; Rev. 21-22), and the everlasting conscious punishment of the lost (Hell) (Luke 16:19-31; Rev. 20:11-15).\r\nSatan\r\n\r\nWE BELIEVE Satan is a real being, a personal devil, that he is the enemy of God, the ‘father of lies,’ the great deceiver of mankind, the instigator of all false systems of religion, and that both he and all his followers will ultimately be cast into the lake of fire (II Cor. 11:13-16; Ephesians 2:2; II Cor. 4:3-4; Rev. 20:2).\r\n\r\nStewardship\r\nWE BELIEVE the Scriptures teach us to give tithes and offerings from our income and resources into the Lord’s treasury in the local church and that all of us have a responsibility before God to be faithful every week in our stewardship (Mal. 3:8-10; Matt. 23:23; I Cor. 16:1, 2).\r\n\r\nPersonal Separation\r\nWE BELIEVE that Christians should be separated unto God and separated from the world and that all believers are called into a life of personal separation from all worldly and sinful practices (James 4:4; Rom. 12:1-2; II Cor. 6:14-18).\r\n\r\nWE BELIEVE a Christian should seek to live a life that is clean, holy and above reproach. He should exhibit both attitude and actions so as to be of good report. Practices which are questionable or which may cause another person to stumble or which may mar the testimony of Christ should be avoided altogether. Therefore personal standards of demeanor and deportment are expected (Eph. 2:10; 4:1; 5:1-4; Phil. 1:27; 3:14-21; 4:8-9).\r\n\r\nThe Lord’s Day\r\nWE BELIEVE that Sunday, the first day of the week, is the Lord’s Day. It is therefore a sacred and special day. It should be a day of worship of the Lord and service to Him, as well as a day of respite and rest from the ordinary routines of life (John 20:1, 19, 26; I Cor. 16:2; Heb. 10:25).\r\n\r\nCreation\r\nWE BELIEVE that God created the universe in six literal, twenty-four-hour periods. We reject evolution, the Gap Theory, the Day-Age Theory, and Theistic Evolution as unscriptural theories of origin (Gen. 1-2; Exo. 20:11).\r\n\r\nCivil Government\r\nWE BELIEVE that God has ordained and created all authority, consisting of three basic institutions: 1) the home, 2) the church, and 3) the state. Every person is subject to these authorities, but all (including the authorities themselves) are answerable to God and governed by His Word. God has given each institution specific Biblical responsibilities and balanced those responsibilities with the understanding that no institution has the right to infringe upon the other. The home, the church and the state are equal and sovereign in their respective, biblically assigned spheres of responsibility under God (Rom.13:1-7; Eph.5:22-24; Heb. 13:17; I Pet. 2:13-14).\r\n\r\nMarriage\r\nWE BELIEVE that the only legitimate marriage is the joining of one man and one woman (Gen. 2:24; Rom. 7:2; I Cor. 7:10; Eph. 5:22-23).\r\n\r\nWE BELIEVE\r\nthat men and women are spiritually equal in position before God but that God has ordained distinct and separate spiritual functions for men and women in the homeand the church. The husband is to be the leader of the home, and men are to be the leaders (pastors and deacons) of the church (Gen. 3:16; Col. 3:18; I Tim. 2:8-15; 3:4-5,12).\r\n\r\nWE BELIEVE\r\nthat God has commanded that no intimate sexual activity be engaged in outside of a marriage. (Ex. 20:14, Heb. 13:4, I Cor. 7:1-5, Mt. 19:4-6).\r\n\r\nWE BELIEVE\r\nthat any form of homosexuality, lesbianism, bisexuality, bestiality, incest, fornication, adultery and pornography are sinful perversions of God’s gift of sex (Gen. 2:24; 19:5, 13; 26:8-9; Lev. 18:1-30; Rom. 1:26-29; I Cor. 5:1; 6:9; I Thess. 4:1-8; Heb. 13:4).\r\n\r\nAbortion\r\nWE BELIEVE that human life begins at conception and the unborn child is a living human being. Abortion constitutes the unjustified, unexcused taking of unborn human life. Abortion is murder. We reject any teaching that abortions of pregnancies due to rape, incest, birth defects, gender selection, birth or population control or the mental well-being of the mother are acceptable (Job 3:16; Ps. 51:5; 139:14-16; Isa. 44:24; 49:1, 5; Jer. 1:5; 20:15-18; Luke 1:44).\r\n\r\nThe Lord’s Supper\r\nWE BELIEVE that the Lord’s Supper is the commemoration, by the use of unleavened bread and of the fruit of the vine, of the death of Christ until He comes again and that it is to be preceded always by solemn self-examination (I Cor. 11:23-28).\r\n\r\nThe Fall of Man\r\nWE BELIEVE the Scriptures teach that man was created in innocence, under the law of his Maker, but by voluntary transgression he fell from that holy and happy state, in consequence of which all mankind are now sinners, not by constraint, but by choice, being by nature utterly void of that holiness required by the law of God, positively inclined to evil, and therefore under just condemnation to eternal ruin, without defense or excuse (Gen. 1:27; 1:31; Acts 17:26; Gen. 2:16,17; 3:6-24; Rom. 5:12,19; Isa. 53:6; Rom. 3:9-18; Eph. 2:3; Rom. 1:18, 32; 2:1-16; Gal. 3:10; Ezek. 18:19, 20; Rom. 1:20; Gal. 3:22).\r\n\r\nThe Virgin Birth of Christ\r\nWE BELIEVE the Scriptures teach that Jesus was begotten of the Holy Spirit in a miraculous manner, born of Mary, a virgin, as no other man was ever born or can ever be born of woman, and that He is both the Son of God and God the Son.\r\n\r\nThe Way of Salvation\r\nWE BELIEVE the Scriptures teach that the salvation of sinners is wholly of grace, through the shed blood and mediatorial offices of the Son of God, Who, according to the will of the Father, assumed our nature, yet without sin, honored the Divine Law by His personal obedience, and by His death made a full atonement for our sins; that having risen from the dead, He is now enthroned in Heaven and uniting in His wonderful person the tenderest sympathies with divine perfection. He is every way qualified to be a suitable, a compassionate and an all-sufficient Saviour (Eph. 2:5; Matt. 18:11; I John 4:10; I Cor. 3:5-7; Acts 15:11; John 3:16; John 1:1-14; Heb. 4:14; 12:24; Phil. 2:6-7; Heb. 2:9, 14; II Cor. 5:21; Isa. 53:4,5; Heb. 7:25; Col. 2:9).\r\n\r\nSoul Winning\r\nWE BELIEVEthat the command to get the Gospel to the world is a clear and unmistakable mandate, that this command is therefore, the commission of God to all of us who are saved. (Matt. 28:18-20; Mark 16:15; John 20:21; Acts 1:8; Rom. 10:13-15).\r\n\r\nWE BELIEVE\r\nsalvation is received when a person honestly sincerely, consciously and deliberately repents (changes their mind about God, Acts 20:21) and places their faith (trust) in the Lord Jesus Christ as Saviour (Acts 20:21, Rom. 10:9-10, Eph. 2:8-9, John 1:12).\r\n\r\nWE FURTHER BELIEVE\r\nthat when we follow Christ appropriately and obediently, we will be a “fisher of men” (Matt. 4:19).\r\n\r\nThe Believer’s Two Natures\r\nWE BELIEVE every truly regenerated, born again Christian is saved by the grace of God through faith placed in Jesus Christ and is thereby awarded a new and spiritual nature which he did not previously possess.\r\n\r\nWE BELIEVE\r\nthe old nature which we possess from birth is not eradicated but lingers yet within us.\r\n\r\nWE BELIEVE\r\nit is for this reason that true Christians are not perfect people and they can still sin.\r\n\r\nWE BELIEVE\r\nthe new nature, if nourished properly, should begin to dominate the Christian’s life, and the old nature should be less and less prominent.\r\n\r\nEcclesiastical Separation\r\nWE BELIEVE that Christian believers and local, New Testament churches should be guided and governed by the Bible, and consequently, we believe it is imperative that we identify false doctrine and those who perpetrate it, and subsequently, stand separate and apart from them.\r\nWe welcome all who come to our doors, but we give no place on our platform to honor or to hear the opinions and the views of those who do not hold to “sound doctrine.”\r\nWith this in view we oppose the widespread popular practice of ecumenism (getting theologically diverse groups together for the sake of fellowship, for the cause of evangelism, and for the exercise of their ministries together).\r\nThe Second Coming\r\n\r\nWE BELIEVE in “that blessed hope,” the personal, literal and visible,premillennial return of our Lord and Saviour, Jesus Christ (I Thess. 4:13-18; II Thess. 2:1-3).","published":true},{"title":"Our Location","body_content":"2002 9th Ave\nRock Falls, IL 61071\n(Across from the Dillon Grade School)","featured_image":[{"id":"attJ0kqLeMgCrRhKZ","url":"https://dl.airtable.com/GXPyrS5fRLRxvwvmyblf_IMG_3706%20-%20Copy%20(2).JPG","filename":"IMG_3706 - Copy (2).JPG","size":4744744,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/a1CuQVfpRq4zR78sVujw_small_IMG_3706%20-%20Copy%20(2).JPG","width":54,"height":36},"large":{"url":"https://dl.airtable.com/cmoRuC1QDiEWBN9u0Z3g_large_IMG_3706%20-%20Copy%20(2).JPG","width":512,"height":512}}}],"published":true},{"title":"Our Pastor","body_content":"Our Pastor\r\n\r\nPastor Tommy McMurtry was saved at an early age, and was raised in a pastor’s home his entire life. He is well acquainted with the ministry life! He was called to full time Christian service while spending the summer as a camp counselor at the age of 19. He came home, and was hired part-time at Lighthouse Baptist Church, learning under his father, Pastor Tom McMurtry. He worked towards his Theology Degree while falling in love, getting married, and having two children!\r\n\r\nHe graduated from Lighthouse Baptist College with a Bachelor’s degree of Theology in 2003. He was ordained shortly after. He worked for ten years as an assistant pastor, music director, and also in the school as the school supervisor for six of those years. He has worked with children, teens, adults, and senior citizens. He came to the Rock Falls/ Sterling area with a burden in his heart for the people here. He can’t wait to see what great things God has in store for Liberty Baptist Church!","featured_image":[{"id":"attjesiPrFgGmj5m7","url":"https://dl.airtable.com/zRF1m7lTSKyiVCgXKRTu_McMurtry.jpg","filename":"McMurtry.jpg","size":4721002,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/wTtO7AkCTbuqPbzrkW7e_small_McMurtry.jpg","width":54,"height":36},"large":{"url":"https://dl.airtable.com/HqQktCiRTvG1VIcURHSJ_large_McMurtry.jpg","width":512,"height":512}}},{"id":"attyCNoZpQY7C8q4Z","url":"https://dl.airtable.com/zlqjZFzQR6C3vljjb3bd_Tommy%20McMurtry.jpg","filename":"Tommy McMurtry.jpg","size":715308,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/nj5MdLWRS3SIff2hTDRY_small_Tommy%20McMurtry.jpg","width":25,"height":36},"large":{"url":"https://dl.airtable.com/w2nnsGVLSDyaCK9NhAwW_large_Tommy%20McMurtry.jpg","width":512,"height":512}}}],"published":true}]
