[{"Section_title":"Visiting Liberty","Content":"Visiting a church for the first time can be a scary experience. At Liberty Baptist, we realize that and want to make you feel as much at ease as possible. We focus on the timeless basics: worshiping God, studying God's Word, serving each other and seeking to make disciples of Jesus Christ. We think we've found something special at LBC. It's more than a church, it's a place where we feel \"at home\" and we want to welcome you to experience it too. Come experience liberty with us!","order":1},{"Section_title":"Our Services","Content":"You are always welcome to join us for any one of our services. Here is some basic information about them: \n\n### Sunday Services\n\nWe have services every Sunday Morning at 10:30 AM and every Sunday Evening at 6:00 PM. We sing some hymns, pray together, and our pastor brings a message from the Bible. Our services rarely last longer than one hour and fifteen minutes.\n\n### Sunday School\n\nWe meet every Sunday at 9:30 AM for Sunday School. We have Sunday School classes for all ages and stages of life. Please check out our ministries page for more information about a Sunday School class.\n\n### Midweek Prayer Meeting\n\nEvery Wednesday at 7:00 PM we meet together for a time of fellowship and prayer. Our Wednesday services are more casual. We hear from a missionary (via video or a prayer letter), Pastor brings a very brief message on prayer, we take prayer requests and then we split up into various groups to pray. Childcare is provided.\n\n","Image":[{"id":"attF08OO2V0F33vkX","url":"https://dl.airtable.com/naCiH5iSOePvN0KD0Omi_atEUNasgTNaQNpateuuh_McMurtry.jpg","filename":"atEUNasgTNaQNpateuuh_McMurtry.jpg","size":3204,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/TTxWh6AQHGD07F7IuoSw_small_atEUNasgTNaQNpateuuh_McMurtry.jpg","width":36,"height":36},"large":{"url":"https://dl.airtable.com/Byq2RZ3OQJSNjhm3Jt4M_large_atEUNasgTNaQNpateuuh_McMurtry.jpg","width":109,"height":109}}}],"order":2},{"Section_title":"For the Kids","Content":"### Nursery\n\nNursery is provided for all of our services. We strive to create a wonderful environment for your littlest ones. Our Nursery is well staffed, and clean. Parents are always welcome.\n\n### Children’s Church\n\nDuring our Sunday Morning service we provide a children’s church for kids from preschool through 6th grade. These kids sit in the “regular” service until right before the message, and then go to their respective children’s church group for an age appropriate message and activities.\n\n### Youth Group\n\nWe have a youth group for teenagers. They meet together during Sunday School and Wednesday nights and during monthly activities.\n","order":3},{"Section_title":"FAQs","Content":" Below are answers to some of the most common questions people often ask before visiting a church?\n\n#### Is there a dress code?\n\nWhile most of the people in our church “dress up” - there is no dress code at the church. We don’t care what you wear, only that you are here. \n\n#### What is your music like?\n\nOur music is very traditional. It is mostly congregational hymns, choir music, and occasionally solos and duets.\n\n#### Am I expected to take part in an offering?\n\nNo! Our offering is for our members and regular attenders. When the offering is passed please just let it go on by.\n\n#### How do I find the church?\n\nThe church is located in the Hartwell neighborhood of Cincinnati on Monon Ave. (8220 Monon Ave) Please use the map below for directions. ","order":4}]
